# MEPCalculationServerInfo Constructor (IExternalServer)

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCalculationServerInfo Constructor (IExternalServer)
MEPCalculationServerInfo Class See Also
---
Create a new MEPCalculationServerInfo by an external server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public MEPCalculationServerInfo(
	IExternalServer server
)
```

Visual Basic
---
```text
Public Sub New ( _
	server As IExternalServer _
)
```

Visual C++
---
```text
public:
MEPCalculationServerInfo(
	IExternalServer^ server
)
```

# ### Parameters
server
    Type: Autodesk.Revit.DB.ExternalService..::..IExternalServer The external server.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
MEPCalculationServerInfo Class
MEPCalculationServerInfo Overload
Autodesk.Revit.DB Namespace